{
  "content_hash": "42968e0a58fa4541bce85268edda2e34",
  "timestamp": "2025-09-26T17:44:16.395531+07:00",
  "result": {
    "repo_summary_line": "A comprehensive microservices ecosystem for the Ronin Wallet, providing quest management, reward distribution, device management, and discovery services for the Ronin ecosystem.",
    "architecture": "microservices",
    "repo_layout": "monorepo",
    "main_stacks": [
      "Go"
    ],
    "monorepo_services": [
      {
        "name": "antenna",
        "path": "cmd/antenna",
        "language": "Go",
        "short_purpose": "Responsible for the Antenna service in the Ronin Wallet application, handling configuration, routing, and dependency injection."
      },
      {
        "name": "cms",
        "path": "cmd/cms",
        "language": "Go",
        "short_purpose": "Responsible for the configuration, initialization, and dependency injection of the CMS application."
      },
      {
        "name": "consumer",
        "path": "cmd/consumer",
        "language": "Go",
        "short_purpose": "Responsible for the consumer service in a wallet application, handling configuration, initialization, and dependency injection."
      },
      {
        "name": "cron_job",
        "path": "cmd/cron_job",
        "language": "Go",
        "short_purpose": "Responsible for managing and executing scheduled tasks (cron jobs) within the application."
      },
      {
        "name": "device_manager",
        "path": "cmd/device_manager",
        "language": "Go",
        "short_purpose": "Responsible for managing device operations and configurations in a web service environment."
      },
      {
        "name": "discovery",
        "path": "cmd/discovery",
        "language": "Go",
        "short_purpose": "Responsible for the configuration, initialization, and dependency injection of the discovery service in the application."
      },
      {
        "name": "proxy",
        "path": "cmd/proxy",
        "language": "Go",
        "short_purpose": "Responsible for managing the proxy service in the Ronin wallet application, including configuration, routing, and dependency injection."
      },
      {
        "name": "push_notification",
        "path": "cmd/push_notification",
        "language": "Go",
        "short_purpose": "Responsible for managing push notification services within the application."
      },
      {
        "name": "quest_center",
        "path": "cmd/quest_center",
        "language": "Go",
        "short_purpose": "Responsible for the quest center service in the Ronin wallet application, handling configuration, routing, and dependency injection."
      },
      {
        "name": "task_scheduler",
        "path": "cmd/task_scheduler",
        "language": "Go",
        "short_purpose": "Responsible for initializing and managing a task scheduling application, including configuration and dependency injection."
      },
      {
        "name": "task_server",
        "path": "cmd/task_server",
        "language": "Go",
        "short_purpose": "Responsible for the task server application, including configuration management, dependency injection, and server initialization."
      },
      {
        "name": "wallet_manager",
        "path": "cmd/wallet_manager",
        "language": "Go",
        "short_purpose": "Responsible for managing wallet operations, including configuration, routing, and dependency injection for the wallet manager application."
      }
    ],
    "evidence_paths": [
      "README.md",
      "docker-compose.yml"
    ],
    "confidence": 1
  }
}